[
    {
      "name": "Derek",
      "text": "We recently had a shutter fitted in the bathroom by grove blinds company ,it looks great .We have used grove before to fit shutters in our dining and living rooms ,this small establishment are a credit to themselves ,you get what you pay for ,a service that is reliable ,helpful and good quality tradespeople. We highly recommend Grove Blind company ,and would use them as a go too company for interior fittings."
    },
    {
      "name": "Gordon",
      "text": "Groves Blinds and Shutters were recommended to us. They came out and gave us a quote. They are reasonably priced. They are friendly and professional. We opted for shutters and the final ones were fitted today. We’d recommend them. Thank you Gareth and Gavin"
    },
    {
      "name": "Simon",
      "text": "We recently purchased some blinds from The Grove Blind & Shutter Co. I wouldn't normally post about a purchase however their customer service, attention to detail and product options was outstanding. Plus they are genuinely lovely people to deal with too. A massive thank you to Gavin and his team. We would highly recommend using them"
    },
    {
      "name": "Eleanor",
      "text": "Exceptional service from start to finish from Gavin and Gareth.  Delighted with the quality of my shutters and wouldn't hesitate to recommend The Grove Blind and Shutter Co.  The care and attention to detail throughout the whole process was definitely a 5 star customer experience.  Thank you to the whole Team."
    },
    {
      "name": "Iker",
      "text": "I recently contacted The Grove Blind and Shutter Co. for a job needed at our Head Office and their service was excellent all round, responding quickly to every query and offering assistance and advice throughout the whole process. Gavin, Gareth and Halle very extremely friendly and would love to do business with them again in the future. I highly recommend them."
    },
    {
      "name": "Sophie",
      "text": "This is our second time buying shutters from Grove Blind and Shutter Co. Gareth and the team are great - really quick to respond, measure and fit. We are so pleased and would totally recommend!"
    }
]